<a href="https://colab.research.google.com/github/951237/TIL/blob/master/TIL_from_191115.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# TIL : 깃허브 입문 191115

## I. 깃허브로 취업하기
- 링크 : https://sujinlee.me/professional-github/

### 1. 매력적인 프로필 만들기
- 사진
    - 얼굴이 클로즈업 된 사진
    - 500 * 500
- 유저네임
    - 본명을 영어로
    - 숫자가 있다면 빼기
- 이멜주소 : 실명으로 만들기
- 프로젝트

### 2. 1일 1커밋
- 매일마다 새로운 것을 배우고 성장하기
- 매일 조금씩이라도 코딩하고 꾸준히 커밋하는 습관 기르기

### 3. 올바르게 커밋하기
- 커밋 단위
- 커밋 메시지 작성법

### 4. 프로젝트 소개 글 작성하기
- 자세하게 작성. 음식레시피와 같음
- 프로젝트명, 프로젝트 소개, 설치방법, 사용예제, 개발 환경 설정 방법, 기여방법, 변경로그, 라이센스 및 작성자 정보 기록

### 5. 오픈 소스 기여하기

### 6. 프로젝트 관리하기

## II. 일일커밋 후기

### 어떻게 시작해야 하나?
- 의미 없는 코드일지라도 일단 시작하기
- 의미 없는 일로 의미 있는 일을 만들기
- 매일 매일 무엇을 커밋할지 생각하기
- Done is better than Perfect
- 따라하기
    - 따라할게 너무 많음.
- 무엇을 커밋해야 될지 모른다면
    - 마크다운부터 시작하기
- 그날 공부했던것을 커밋하기
    - 자기가 편한 방식으로 커밋하기
- 스택오버플로 링크와 함께 복붙하지 않고 직접 타이핑
    - 남의 코드를 따라하더라도 복붙하지 않고 직접타이핑을 해야 내것이 됨.
- TIL 폴더 만들기
- 캐글로 데이터 사이언스 공부
- 캐글의 튜토리얼 따라하기
- 자연어 처리 : bag of word meets bags of popcom
- 튜토리얼 변형하기 / 번역하기 / 나만의 튜토리얼 만들기
- 책에서 본 코드 따라하기
- 간단한 튜토리얼 번역
- 스프린트 참여
- 정적 블로그 운영
    - TIL로 정리했던 내용이나 블로그로 쓸만한 내용들
    - 깃헙에 튜토리얼이 있음.

## III. 리퍼지토리 작성 실습

### 리퍼지토리 생성하기
- TIL 생성하기
    - public

# 판다스

## TIL 191203 : apply 함수 이용하기
- 발명반 원서 정렬시 기호를 글자로 바꾸기

## TIL 191204 : 학년에 맞게 학급으로 변환



```
def make_classIndex(row):
    if str(row)[0] == '3':
        k = '초급'
    elif str(row)[0] == '4':
        k = '중급'
    else:
        k = '심화'
    return k
```



```
df_result['지원반'] = df_result['소속반(2019)'].apply(make_classIndex)
df_result.head()
```

## TIL 191211 나머지가 생기지 않게하는 수 찾기



```
print( 11 % 4) # 나머지 구하기

def div_zero(k, r):
    for i in range(1, r, 1):
        if int(k % i) == 0:
            print(i)
        else:
            continue
            
div_zero(340, 15)
```

## 191215 칼럼 값을 리스트와 비교해서 일치하는 행만 데이터프레임에 저장



```
df_hyuk = df[ df['소속'].isin(list_hyuk) 
```

## 191215 함수 - Apply 함수 끝에서 2개의 값만 반환



```
def extract_day(row):
    return row[-2:]
df_hyuk['절상'] = df_hyuk['현임교_발령일자'].apply(extract_day)
```

## 191215 Apply 함수 - 값이 범위안에 있는 경우 텍스트를 반환
- 텍스트를 숫자로 변환해서 비교



```
    def compare_day(row):
        if int(row) > 2 and int(row) < 15:
            return '절상'

    df_hyuk['절상'] = df_hyuk['절상'].apply(compare_day)
```

## 191215 칼럼값이 일치하는 행들을 데이터 프레임으로 저장



```
df_hyuk_up = df_hyuk[ df_hyuk['절상'] == '절상' ]
```

## 191215 데이터 프레임 엑셀저장
- 여러개의 데이터프레임을 시트이름을 정해서 저장하기



```
def writer_excel(file_path):
    writer = pd.ExcelWriter(file_path)
    df_hyuk_up_gen.to_excel(writer, sheet_name='혁신학교 절상명단_일반', index=False)
    df_hyuk_up_gap.to_excel(writer, sheet_name='혁신학교 절상명단_갑만기', index=False)
    writer.save()
```

## TIL - 191217

### 191217 여러개의 칼럼을 더해서 코드 만들기



```
df_all_real_cho['코드_동명이인'] = df_all_real_cho['지역'] + df_all_real_cho['소속'] + df_all_real_cho['이름']
```

### 동명이인 찾기



```
df_all_real_cho[ df_all_real_cho['코드_동명이인'].duplicated() ]
```

### 원하는 값 필터링 하기



```
df_all_real_cho[ df_all_real_cho['이름'] == '김동현' ]
```

## TIL - 191219

### 데이터 전처리 - 엑셀파일 가져오기



```
use_cols = (2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26)
df_med = pd.read_excel(filepath, 
                header = None,  #헤더를 가져오지 않음.
                usecols = use_cols # 사용할 칼럼들을 선택
                 ).iloc[9:,:] #가져올 행을 선택
```

### 데이터 전처리 - 인덱스 1부터 넘버링



```
df_med = df_med.reset_index(drop = True) # 인덱스 리셋
df_med.index = df_med.index + 1 #인덱스에 1을 더하여 1부터 시작
```

## TIL - 191220

### 발령데이터 프로젝트 계획
- 카테고리 : 년도
    - 인원변동
    - 유형변동
    - 성별변동
- 카테고리 : 지역
    - 발령인원 현황
    - 지원현황
    - 지원대비 발령 %

## TIL - 191221 판다스 데이터 전처리 함수 연습

### 컬럼 이름 바꾸기



```
df.columns = [ 'a', 'b', 'c']
```

### 빈값 찾기



```
pd.isnull()
```

### 빈값 아닌 것 찾기



```
pd.notnull()
```

### null 값을 포함한 행 삭제



```
df.dropna()

```

### null 값을 포함한 칼럼 삭제



```
df.dropna(axis = 1)
```

### n값보다 작은 값은 모두 삭제



```
df.dropna(axis = 1, thresh = n)
```

### q빈값을 x로 채우기



```
df.fillna(x)
```

### 빈값을 평균으로 채우기


```
s.fillna(s.means())
```

### 시리즈 타입을 실수형으로 바꾸기



```
s.astype(float)
```

### 시리즈의 1의 값을 'one'로 바꾸기



```
s.replace(1, 'one')
```

### 다수의 값을 바꾸는 방법



```
s.replace([1,3], ['one', 'three'])
```

### 다수의 칼럼 이름 바꾸기



```
df.rename(columns = lamda x: x+ 1)
```

### 칼럼 이름 바꾸기



```
df.rename( columns = {'old_name' : 'new_name'})
```

### 칼럼을 인덱스로 지정하기



```
df.set_index('colums one')
```

### 람다식을 이용하여 인덱스에 1씩 증가



```
df.rename(index = lamda x: x+1)
```

## TIL - 191223 - 필터링 / 소팅

### 0.5 보다 큰 값들만 찾기



```
df[ df[col] > 0.5 ]
```

### 0.5 보다 크고 0.7보다 작은 값 필터링



```
df [ ( df[col] > 0.5 ) & ( df[col] < 0.7 ) ]
```

### col1 칼럼 소팅하기



```
df.sort_values(col1)
```

### col2 내림차순으로 정렬



```
df.sort_values(col2, ascending = False)
```

### col1은 오름차순 정렬, col2 칼럼은 내림차순으로 정렬



```
df.sort_values([col1, col2], ascending = [True, False])
```

## TIL - 191224 Groupby의 활용
소스 : https://ponyozzang.tistory.com/291

In [0]:
import seaborn as sns
import pandas as pd

In [0]:
df_titanic = sns.load_dataset('titanic')

In [4]:
df_titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [0]:
df_titanic.groupby('sex').mean()

In [0]:
df_titanic.groupby('survived').mean()

In [8]:
g = df_titanic.groupby('class')
g

In [16]:
g.get_group('First')

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
3           1       1  female  35.0  ...     C  Southampton    yes  False
6           0       1    male  54.0  ...     E  Southampton     no   True
11          1       1  female  58.0  ...     C  Southampton    yes   True
23          1       1    male  28.0  ...     A  Southampton    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
871         1       1  female  47.0  ...     D  Southampton    yes  False
872         0       1    male  33.0  ...     B  Southampton     no   True
879         1       1  female  56.0  ...     C    Cherbourg    yes  False
887         1       1  female  19.0  ...     B  Southampton    yes   True
889         1       1    male  26.0  ...     C    Cherbourg    yes   True

[216 rows x 14 columns]

In [37]:
g.get_group('Second')

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
9           1       2  female  14.0  ...   NaN    Cherbourg    yes  False
15          1       2  female  55.0  ...   NaN  Southampton    yes   True
17          1       2    male   NaN  ...   NaN  Southampton    yes   True
20          0       2    male  35.0  ...   NaN  Southampton     no   True
21          1       2    male  34.0  ...     D  Southampton    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
866         1       2  female  27.0  ...   NaN    Cherbourg    yes  False
874         1       2  female  28.0  ...   NaN    Cherbourg    yes  False
880         1       2  female  25.0  ...   NaN  Southampton    yes  False
883         0       2    male  28.0  ...   NaN  Southampton     no   True
886         0       2    male  27.0  ...   NaN  Southampton     no   True

[184 rows x 14 columns]

In [18]:
g.groups

{'First': Int64Index([  1,   3,   6,  11,  23,  27,  30,  31,  34,  35,
             ...
             853, 856, 857, 862, 867, 871, 872, 879, 887, 889],
            dtype='int64', length=216),
 'Second': Int64Index([  9,  15,  17,  20,  21,  33,  41,  43,  53,  56,
             ...
             848, 854, 861, 864, 865, 866, 874, 880, 883, 886],
            dtype='int64', length=184),
 'Third': Int64Index([  0,   2,   4,   5,   7,   8,  10,  12,  13,  14,
             ...
             875, 876, 877, 878, 881, 882, 884, 885, 888, 890],
            dtype='int64', length=491)}

In [46]:
for key, item in g:
    print(key)
    print(g.get_group(key), "\n\n")

First
     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
3           1       1  female  35.0  ...     C  Southampton    yes  False
6           0       1    male  54.0  ...     E  Southampton     no   True
11          1       1  female  58.0  ...     C  Southampton    yes   True
23          1       1    male  28.0  ...     A  Southampton    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
871         1       1  female  47.0  ...     D  Southampton    yes  False
872         0       1    male  33.0  ...     B  Southampton     no   True
879         1       1  female  56.0  ...     C    Cherbourg    yes  False
887         1       1  female  19.0  ...     B  Southampton    yes   True
889         1       1    male  26.0  ...     C    Cherbourg    yes   True

[216 rows x 14 columns]


Second
     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
9           1       2  female  14.0  ...   NaN    Cherbourg    yes  False
15          1       2  female  55.0  ...   NaN  Southampton    yes   True
17          1       2    male   NaN  ...   NaN  Southampton    yes   True
20          0       2    male  35.0  ...   NaN  Southampton     no   True
21          1       2    male  34.0  ...     D  Southampton    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
866         1       2  female  27.0  ...   NaN    Cherbourg    yes  False
874         1       2  female  28.0  ...   NaN    Cherbourg    yes  False
880         1       2  female  25.0  ...   NaN  Southampton    yes  False
883         0       2    male  28.0  ...   NaN  Southampton     no   True
886         0       2    male  27.0  ...   NaN  Southampton     no   True

[184 rows x 14 columns]


Third
     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
4           0       3    male  35.0  ...   NaN  Southampton     no   True
5           0       3    male   NaN  ...   NaN   Queenstown     no   True
7           0       3    male   2.0  ...   NaN  Southampton     no  False
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
882         0       3  female  22.0  ...   NaN  Southampton     no   True
884         0       3    male  25.0  ...   NaN  Southampton     no   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
888         0       3  female   NaN  ...   NaN  Southampton     no  False
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[491 rows x 14 columns]

In [59]:
for key, value in g.groups.items():
    print(key)
    print(value)

First
Int64Index([  1,   3,   6,  11,  23,  27,  30,  31,  34,  35,
            ...
            853, 856, 857, 862, 867, 871, 872, 879, 887, 889],
           dtype='int64', length=216)
Second
Int64Index([  9,  15,  17,  20,  21,  33,  41,  43,  53,  56,
            ...
            848, 854, 861, 864, 865, 866, 874, 880, 883, 886],
           dtype='int64', length=184)
Third
Int64Index([  0,   2,   4,   5,   7,   8,  10,  12,  13,  14,
            ...
            875, 876, 877, 878, 881, 882, 884, 885, 888, 890],
           dtype='int64', length=491)

In [53]:
gb.keys()

dict_keys(['First', 'Second', 'Third'])

In [54]:
gb.values()

dict_values([Int64Index([  1,   3,   6,  11,  23,  27,  30,  31,  34,  35,
            ...
            853, 856, 857, 862, 867, 871, 872, 879, 887, 889],
           dtype='int64', length=216), Int64Index([  9,  15,  17,  20,  21,  33,  41,  43,  53,  56,
            ...
            848, 854, 861, 864, 865, 866, 874, 880, 883, 886],
           dtype='int64', length=184), Int64Index([  0,   2,   4,   5,   7,   8,  10,  12,  13,  14,
            ...
            875, 876, 877, 878, 881, 882, 884, 885, 888, 890],
           dtype='int64', length=491)])

In [20]:
g.indices

{'First': array([  1,   3,   6,  11,  23,  27,  30,  31,  34,  35,  52,  54,  55,
         61,  62,  64,  83,  88,  92,  96,  97, 102, 110, 118, 124, 136,
        137, 139, 151, 155, 166, 168, 170, 174, 177, 185, 187, 194, 195,
        209, 215, 218, 224, 230, 245, 248, 252, 256, 257, 258, 262, 263,
        268, 269, 270, 273, 275, 284, 290, 291, 295, 297, 298, 299, 305,
        306, 307, 309, 310, 311, 318, 319, 325, 329, 331, 332, 334, 336,
        337, 339, 341, 351, 356, 366, 369, 370, 373, 375, 377, 380, 383,
        390, 393, 412, 430, 434, 435, 438, 445, 447, 449, 452, 453, 456,
        457, 460, 462, 467, 475, 484, 486, 487, 492, 493, 496, 498, 504,
        505, 507, 512, 513, 515, 520, 523, 527, 536, 537, 539, 540, 544,
        545, 550, 555, 556, 557, 558, 571, 572, 577, 581, 583, 585, 587,
        591, 599, 602, 604, 607, 609, 621, 625, 627, 630, 632, 633, 641,
        645, 647, 659, 660, 662, 669, 671, 679, 681, 689, 690, 694, 698,
        700, 701, 707, 708, 710, 711, 712, 716, 724, 730, 737, 740, 741,
        742, 745, 748, 759, 763, 765, 766, 779, 781, 782, 789, 793, 796,
        802, 806, 809, 815, 820, 822, 829, 835, 839, 842, 849, 853, 856,
        857, 862, 867, 871, 872, 879, 887, 889]),
 'Second': array([  9,  15,  17,  20,  21,  33,  41,  43,  53,  56,  58,  66,  70,
         72,  78,  84,  98,  99, 117, 120, 122, 123, 133, 134, 135, 144,
        145, 148, 149, 150, 161, 178, 181, 183, 190, 191, 193, 199, 211,
        213, 217, 219, 221, 226, 228, 232, 234, 236, 237, 238, 239, 242,
        247, 249, 259, 265, 272, 277, 288, 292, 303, 308, 312, 314, 316,
        317, 322, 323, 327, 340, 342, 343, 344, 345, 346, 357, 361, 385,
        387, 389, 397, 398, 399, 405, 407, 413, 416, 417, 418, 426, 427,
        432, 437, 439, 440, 443, 446, 450, 458, 463, 466, 472, 473, 476,
        481, 506, 516, 518, 526, 529, 530, 535, 543, 546, 547, 549, 551,
        562, 570, 576, 580, 582, 586, 594, 596, 600, 608, 615, 618, 619,
        626, 635, 637, 651, 655, 658, 665, 666, 670, 672, 673, 674, 684,
        685, 695, 705, 706, 714, 717, 720, 722, 723, 726, 728, 732, 733,
        734, 747, 750, 754, 755, 757, 772, 774, 791, 795, 800, 801, 808,
        812, 817, 827, 831, 841, 848, 854, 861, 864, 865, 866, 874, 880,
        883, 886]),
 'Third': array([  0,   2,   4,   5,   7,   8,  10,  12,  13,  14,  16,  18,  19,
         22,  24,  25,  26,  28,  29,  32,  36,  37,  38,  39,  40,  42,
         44,  45,  46,  47,  48,  49,  50,  51,  57,  59,  60,  63,  65,
         67,  68,  69,  71,  73,  74,  75,  76,  77,  79,  80,  81,  82,
         85,  86,  87,  89,  90,  91,  93,  94,  95, 100, 101, 103, 104,
        105, 106, 107, 108, 109, 111, 112, 113, 114, 115, 116, 119, 121,
        125, 126, 127, 128, 129, 130, 131, 132, 138, 140, 141, 142, 143,
        146, 147, 152, 153, 154, 156, 157, 158, 159, 160, 162, 163, 164,
        165, 167, 169, 171, 172, 173, 175, 176, 179, 180, 182, 184, 186,
        188, 189, 192, 196, 197, 198, 200, 201, 202, 203, 204, 205, 206,
        207, 208, 210, 212, 214, 216, 220, 222, 223, 225, 227, 229, 231,
        233, 235, 240, 241, 243, 244, 246, 250, 251, 253, 254, 255, 260,
        261, 264, 266, 267, 271, 274, 276, 278, 279, 280, 281, 282, 283,
        285, 286, 287, 289, 293, 294, 296, 300, 301, 302, 304, 313, 315,
        320, 321, 324, 326, 328, 330, 333, 335, 338, 347, 348, 349, 350,
        352, 353, 354, 355, 358, 359, 360, 362, 363, 364, 365, 367, 368,
        371, 372, 374, 376, 378, 379, 381, 382, 384, 386, 388, 391, 392,
        394, 395, 396, 400, 401, 402, 403, 404, 406, 408, 409, 410, 411,
        414, 415, 419, 420, 421, 422, 423, 424, 425, 428, 429, 431, 433,
        436, 441, 442, 444, 448, 451, 454, 455, 459, 461, 464, 465, 468,
        469, 470, 471, 474, 477, 478, 479, 480, 482, 483, 485, 488, 489,
        490, 491, 494, 495, 497, 499, 500, 501, 502, 503, 508, 509, 510,
        511, 514, 517, 519, 521, 522, 524, 525, 528, 531, 532, 533, 534,
        538, 541, 542, 548, 552, 553, 554, 559, 560, 561, 563, 564, 565,
        566, 567, 568, 569, 573, 574, 575, 578, 579, 584, 588, 589, 590,
        592, 593, 595, 597, 598, 601, 603, 605, 606, 610, 611, 612, 613,
        614, 616, 617, 620, 622, 623, 624, 628, 629, 631, 634, 636, 638,
        639, 640, 642, 643, 644, 646, 648, 649, 650, 652, 653, 654, 656,
        657, 661, 663, 664, 667, 668, 675, 676, 677, 678, 680, 682, 683,
        686, 687, 688, 691, 692, 693, 696, 697, 699, 702, 703, 704, 709,
        713, 715, 718, 719, 721, 725, 727, 729, 731, 735, 736, 738, 739,
        743, 744, 746, 749, 751, 752, 753, 756, 758, 760, 761, 762, 764,
        767, 768, 769, 770, 771, 773, 775, 776, 777, 778, 780, 783, 784,
        785, 786, 787, 788, 790, 792, 794, 797, 798, 799, 803, 804, 805,
        807, 810, 811, 813, 814, 816, 818, 819, 821, 823, 824, 825, 826,
        828, 830, 832, 833, 834, 836, 837, 838, 840, 843, 844, 845, 846,
        847, 850, 851, 852, 855, 858, 859, 860, 863, 868, 869, 870, 873,
        875, 876, 877, 878, 881, 882, 884, 885, 888, 890])}

In [23]:
g.all()

        survived  pclass   sex   age  ...  deck  embark_town  alive  alone
class                                 ...
First      False    True  True  True  ...  True         True   True  False
Second     False    True  True  True  ...  True         True   True  False
Third      False    True  True  True  ...  True         True   True  False

[3 rows x 14 columns]

In [24]:
g.any()

        survived  pclass   sex   age  ...  deck  embark_town  alive  alone
class                                 ...
First       True    True  True  True  ...  True         True   True   True
Second      True    True  True  True  ...  True         True   True   True
Third       True    True  True  True  ...  True         True   True   True

[3 rows x 14 columns]

In [25]:
g.count()

        survived  pclass  sex  age  ...  deck  embark_town  alive  alone
class                               ...
First        216     216  216  186  ...   175          214    216    216
Second       184     184  184  173  ...    16          184    184    184
Third        491     491  491  355  ...    12          491    491    491

[3 rows x 14 columns]

In [26]:
g.cumcount()

0        0
1        0
2        1
3        1
4        2
      ...
886    183
887    214
888    489
889    215
890    490
Length: 891, dtype: int64

In [28]:
g.cummax()

     survived  pclass   age  sibsp  parch      fare  adult_male  alone
0           0       3  22.0      1      0    7.2500        True  False
1           1       1  38.0      1      0   71.2833       False  False
2           1       3  26.0      1      0    7.9250        True   True
3           1       1  38.0      1      0   71.2833       False  False
4           1       3  35.0      1      0    8.0500        True   True
..        ...     ...   ...    ...    ...       ...         ...    ...
886         1       2  70.0      3      3   73.5000        True   True
887         1       1  80.0      3      4  512.3292        True   True
888         1       3   NaN      8      6   69.5500        True   True
889         1       1  80.0      3      4  512.3292        True   True
890         1       3  74.0      8      6   69.5500        True   True

[891 rows x 8 columns]

In [29]:
g.head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0          0       3    male  22.0  ...   NaN  Southampton     no  False
1          1       1  female  38.0  ...     C    Cherbourg    yes  False
2          1       3  female  26.0  ...   NaN  Southampton    yes   True
3          1       1  female  35.0  ...     C  Southampton    yes  False
4          0       3    male  35.0  ...   NaN  Southampton     no   True
5          0       3    male   NaN  ...   NaN   Queenstown     no   True
6          0       1    male  54.0  ...     E  Southampton     no   True
7          0       3    male   2.0  ...   NaN  Southampton     no  False
9          1       2  female  14.0  ...   NaN    Cherbourg    yes  False
11         1       1  female  58.0  ...     C  Southampton    yes   True
15         1       2  female  55.0  ...   NaN  Southampton    yes   True
17         1       2    male   NaN  ...   NaN  Southampton    yes   True
20         0       2    male  35.0  ...   NaN  Southampton     no   True
21         1       2    male  34.0  ...     D  Southampton    yes   True
23         1       1    male  28.0  ...     A  Southampton    yes   True

[15 rows x 15 columns]

In [30]:
g.ngroup()

0      2
1      0
2      2
3      0
4      2
      ..
886    1
887    0
888    2
889    0
890    2
Length: 891, dtype: int64

In [32]:
g.rank

In [33]:
g.size()

class
First     216
Second    184
Third     491
dtype: int64

In [34]:
g.sum()

        survived  pclass      age  sibsp  parch        fare  adult_male  alone
class
First        136     216  7111.42     90     77  18177.4125       119.0  109.0
Second        87     368  5168.83     74     70   3801.8417        99.0  104.0
Third        119    1473  8924.92    302    193   6714.6951       319.0  324.0

In [35]:
g.var()

        survived  pclass         age  ...         fare  adult_male     alone
class                                 ...
First   0.234281     0.0  219.124543  ...  6143.482816    0.248557  0.251141
Second  0.250624     0.0  196.030152  ...   180.026589    0.249911  0.247090
Third   0.183998     0.0  156.134976  ...   138.724622    0.228056  0.224897

[3 rows x 8 columns]

In [36]:
g.std()

        survived  pclass        age  ...       fare  adult_male     alone
class                                ...
First   0.484026     0.0  14.802856  ...  78.380373    0.498555  0.501140
Second  0.500623     0.0  14.001077  ...  13.417399    0.499911  0.497081
Third   0.428949     0.0  12.495398  ...  11.778142    0.477552  0.474233

[3 rows x 8 columns]